import UIKit


struct Book {
    let title: String
    let author: String
    let photo: String
    let description: String
    var rating: Float
}

struct Model {
    let books = [
           Book(title: "Тролът Сърдитко. Коледа е!", author: "Барбара ван ден Шпойлхоф, Щефан Прикен", photo: "sarditko_001.png", description: """
Всяка година едно и също...
Коледа е точно зад ъгъла и разбира се, тролът Сърдитко иска да празнува. Той много добре знае от какво се състои идеалният празник: вкусни курабийки, красива елха, много подаръци и разбира се, всичко да е по реда си.

Под негова команда приятелите му полагат големи усилия, но въпреки това всичко се обърква: курабийките прегарят, на никого не му се чисти, елхата е крива, а подаръците са истинско разочарование. Няма съмнение, че в корема на Сърдитко бавно, но сигурно се завихря гневна буря.

И не е единствен...
""", rating: 4.5),
           Book(title: "Оно и Онче. Приятелите са най-хубавият подарък", author: "Томас Шпрингер, Александра Лангенбек", photo: "ono_onche_friends.png", description: """
Ура! Наближава Коледа – с елха, подаръци и с всичките ни приятели!

Видрата Онче я чака с нетърпение! Но на стария рибар Оно цялата суматоха му идва в повече. Тюлени, раци и чайки под коледното дръвче? Ама че щуротия!

После над морето се извива ужасна снежна буря и снегът затрупва Олга, жената на Оно, сред крайбрежната плитчина с всичките ѝ коледни покупки.

Ще пропадне ли тъй мечтаният от Онче коледен празник?
""", rating: 4.5),
           Book(title: "Оно и Онче. Най-добрият приятел на света", author: "Томас Шпрингер, Александра Лангенбек", photo: "ono_onche_best_friends.png", description: """
Ура! Наближава Коледа – с елха, подаръци и с всичките ни приятели!

Видрата Онче я чака с нетърпение! Но на стария рибар Оно цялата суматоха му идва в повече. Тюлени, раци и чайки под коледното дръвче? Ама че щуротия!

После над морето се извива ужасна снежна буря и снегът затрупва Олга, жената на Оно, сред крайбрежната плитчина с всичките ѝ коледни покупки.

Ще пропадне ли тъй мечтаният от Онче коледен празник?
""", rating: 4.5),
           
        ]
}

